Revit 2027 API
DirectShape.GetOptions Method
 Gets a copy of the current options for this DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectShapeOptions GetOptions()
Public Function GetOptions As DirectShapeOptions
public:
DirectShapeOptions^ GetOptions()
member GetOptions : unit -> DirectShapeOptions
Return Value
DirectShapeOptions
 Options currently set for this DirectShape.
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace